# -*- coding: utf-8 -*-


cn_all_conj = {
    '只有', '或者', '虚字', '无论', '所以', '也不', '当使', '可是', '设若', '除非', '纵然',
    '加以', '于是', '况且', '而且', '不料', '于是乎', '否则', '倘然', '不过', '顺推', '便做',
    '如其', '就是', '倘使', '是以', '又且', '还', '万一', '以至于', '况于', '都', '或曰',
    '至乃', '何况', '及至', '纵使', '而亦', '而况', '不但', '等到', '连絶', '丕乃', '源于',
    '那么', '以下', '虚词', '而乃', '一边', '至乎', '分句', '以至', '不管', '但凡', '设或',
    '尔其', '要么', '与其', '或是', '则', '因', '倘若', '如果', '若是', '故尔', '然而', '基于',
    '但是', '便乃', '至若', '亡其', '因此', '之所以', '宁可', '纵令', '再不', '焉乃', '要是',
    '及以', '诚然', '词类', '然则', '乃至', '只要', '至于', '以致', '因为', '借令', '勿然',
    '不如', '为此', '不怕', '是故', '不是', '凡事', '假如', '以为', '庶几', '以及', '故',
    '从而', '且夫', '才', '甚至', '借使', '至如', '以致于', '借如', '譬如', '固然', '不然',
    '假使', '不拘', '不仅', '果然', '致使', '忘其', '别管', '况乎', '不论', '虽然', '缘于',
    '由于', '就', '顺接', '加之', '丕则', '反而', '任凭', '但', '在于', '因而', '即使', '故而',
    '假借义', '自然', '既然', '尽管', '虽说', '也是', '再说', '哪怕'
}

# 候选词表
cn_ambiguous_verb = {
    '诱导', '触发', '决定', '勾起', '诱使', '诱发', '影响', '致使',
    '推动', '促发', '带来', '产生', '促成', '发展', '酿成', '引致'
}
cn_ambiguous_reverse_verb = {
    '出于', '出自', '发源于', '发自', '根源于',
    '来源于', '来自', '起源于', '取决于', '在于', '归功于'
}

cn_ambiguous_conj = {'若是', '就', '假使', '倘若', '假如', '那么', '只要', '如果', '才', '只有', '则', '既然'}
cn_ambiguous_conj_combo = {
    '既然就', '如果就', '只要就', '如果那么', '如果则', '只有才', '若是就', '若是那么', '若是则',
    '假如那么', '假如就', '假如则', '假使那么', '假使则', '假使就', '倘若那么', '倘若就', '倘若则'
}

cn_v3 = {'成灾', '成瘾', '成癖', '架空'}
cn_v4 = {'毒死', '风干', '饿死', '毒杀'}
cn_p1 = ['为了', '按照', '依据', '凭借', '因为', '由于']
cn_d1 = {'为此', '以便', '以免', '才'}

# 因果词表
cn_how_net = {
    '引致', '在于', '致使', '所以', '从而', '依据', '令人', '诱导', '诱发', '致死', '以至', '喜欢',
    '造就', '费事', '基于', '召祸', '为', '以致', '渗透', '出于', '如果', '诱致', '埋怨', '风干',
    '波及', '造成', '挟带', '予以', '令', '为此', '才', '促进', '招致', '使得', '缘于', '酿成',
    '解密', '生气', '作用', '指引', '产生', '成癖', '引出', '发自', '诱使', '促发', '导向', '故而',
    '由于', '致残', '成灾', '浸染', '普及', '致病', '立足', '源于', '根源于', '渗入', '触发', '凭',
    '诱杀', '归于', '因', '以致于', '靠', '影响', '引导', '推动', '后悔', '以', '引来', '取决于',
    '发源于', '只要', '因为', '来自', '以免', '勾起', '成瘾', '因此', '攸关', '固定', '毒死', '带来',
    '以至于', '放飞', '架空', '诱惑', '发汗', '来源于', '滋生', '导致', '引入', '以便', '既然', '立足于',
    '故', '推进', '起源于', '促成', '引发', '按照', '使', '为了', '决定', '出自', '关系', '于是', '惹火',
    '促使', '牵动', '受伤', '引起', '致命', '取决', '饿死', '因而', '放活'
}

# C_Cause_C_Effect
cn_cause_cue_set = {'因', '因为', '由于', '既然'}
cn_effect_cue_set = {'为此', '所以', '因此', '以致于', '因而', '于是', '故', '故而', '以至于', '从而', '致使'}
cn_combo_cue_set = {
    '因为所以', '因为因此', '因为以致于', '因为因而', '因为于是', '因为故', '因为故而', '因为以至于',
    '因所以', '因因此', '因以致于', '因因而', '因于是', '因故', '因故而', '因以至于', '由于以至',
    '由于因此', '由于所以', '由于以致于', '由于以致于', '由于故', '由于于是', '由于从而', '由于故而',
    '既然因此', '既然所以', '既然故而', '既然因而', '由于因而', '因为从而', '因为致使', '由于致使',
    '因为为此', '由于为此', '由于致使'
}

# C_Effect_C_Cause
cn_reverse_effect_cue_set = {'之所以'}
cn_reverse_cause_cue_set = {
    '缘于', '因为', '由于', '在于', '基于', '出于', '根源于', '来源于', '来自', '起源于', '取决于', '立足于', '源于'
}
cn_reverse_combo_cue_set = {
    '之所以因为', '之所以由于', '之所以缘于', '之所以在于', '之所以出于', '之所以根源于',
    '之所以来源于', '之所以来自', '之所以起源于', '之所以取决于', '之所以立足于', '之所以源于'
}

# Cause_C_Effect
cn_single_effect_cue_set = {'所以', '以致于', '因此', '因而', '以至于', '故而'}

# Effect_C_Cause
cn_single_cause_cue_set = {'因为', '由于', '缘于', '在于', '源于', '因'}

# Cause_V_Effect
cn_causal_verb_set = {'导致', '造成', '引起', '使得', '使', '引来', '促使', '引发', '招致'}

global_cn_conj_words = {'因', '因为', '由于', '由'}
global_cn_refers_words = {'由此', '因此', '这', '对此', '那', '这些', '那些'}
global_cn_noise_words = {'对', '对于', '给', '为'}
global_cn_comma_words = {'，', '；'}
global_cn_neg_words = {
    '没有', '不能', '没法', '不会', '是否', '是否会', '不', '不可能',
    '尚未', '还没', '非', '并非', '不是', '并不', '无法'
}
global_cn_neg_modifier = {'不', '非', '并非', '不是', '并不'}
global_cn_punctuation = {'“', '”', '《', '》', '：', '；', '、', '（', '）', '〈', '〉', '，', '。'}
